Repository: C0BALite/binchecker
Catalog: po/*.po
Languages: ru

source: Application which checks binaries for errors
ru: Приложение, проверяющее двоичные файлы на ошибки

source: This application is written using gtk/adw in C language. The application uses a shared library libbindiff.so. It compares files in two separate directories, finds differences in binary data and displays them. Symbolic links, nonexistent files and files requiring permission are skipped.
ru: Приложение написано с использованием gtk/adw на языке C. Приложение использует разделяемую библиотеку libbindiff.so. Оно сравнивает файлы в двух различных директориях, ищет несовпадения в двоичных данных и показывает их. Символьные ссылки, несуществующие файлы и файлы, требующие прав доступа пропускаются.

source: Difference %d: Position: %d Length: %d bytes File 1: %s File 2: %s
ru: Разница %d: Позиция: %d Длинна: %d bytes Файл 1: %s Файл 2: %s

source: Differences in: %s
ru: Различия в: %s

# dialog-title
source: File Differences
ru: Различия в файлах

# button
source: Close
ru: Закрыть

# tooltip|main-menu
source: Main Menu
ru: Главное меню

# group-title|directory-selection
source: Directory selection
ru: Выбор директорий

# row-subtitle|choose-directory
source: Choose directory
ru: Выберите директорию

# row-title|first-directory
source: First directory
ru: Первая директория

# tooltip|select-first-dir
source: Select first directory
ru: Выберите первую директорию

# row-title|second-directory
source: Second directory
ru: Вторая директория

# tooltip|select-second-dir
source: Select second directory
ru: Выберите вторую директорию

# row-subtitle|padding-amount
source: amount of bytes to pad the corrupted bytes with
ru: размер контекста, предоставляемого вокруг битых данных

# row-title|padding-amount
source: Padding amount
ru: Размер контекста

# tooltip|padding-amount
source: Set the padding amount for corrupted bytes
ru: Выставите размер контекста вокруг битых данных

# button-label|compare-folders
source: Compare folders
ru: Сравнить директории

# tooltip|compare-folders
source: Start comparing the selected directories
ru: Начать сравнивать выбранные директории

# page-title|results
source: Results
ru: Результат

# view-name|results
source: Result
ru: Результат

# menu-item
source: _Preferences
ru: Предпочтения

# menu-item
source: _Keyboard Shortcuts
ru: Горячие клавиши

# menu-item
source: _About BinChecker
ru: О Приложении
